In [19]:
import numpy as np
import pandas as pd

In [20]:
from numpy.random import randn

In [21]:
np.random.seed(101)

In [58]:
df = pd.DataFrame(data = randn(5,4),index = ["A","B","C","D","E"],columns=["W","X","Y","Z"])
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [59]:
df["W"]

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [60]:
df["X"]

A    1.693723
B    0.390528
C    0.072960
D   -0.754070
E    1.901755
Name: X, dtype: float64

In [61]:
df[["W","Y"]]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905
C  0.807706  0.638787
D -0.497104 -0.943406
E -0.116773  0.238127

In [62]:
df["new"] = df["W"] +df["Y"]
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [63]:
df.drop("new",axis=1,inplace=True) #Axis equal to 0 refers to the index

#The inplace argument is necessary if you really want to modify the object, otherwise df'll still have the "new" column

In [64]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [65]:
df.drop("E",axis=0,inplace=True)
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [66]:
df.loc["C"]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [67]:
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [68]:
df.loc["B","Z"]

0.18450185928224264

In [69]:
df.loc[["A","C"],["W","X"]]

          W         X
A  0.302665  1.693723
C  0.807706  0.072960

In [70]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752

In [71]:
resultDf = df[df["W"]>0]

In [72]:
df[df["Z"]<0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [73]:
resultDf

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [74]:
resultDf["X"]

A    1.693723
C    0.072960
Name: X, dtype: float64

In [75]:
df[df["W"]>0][["X","Z"]]

          X         Z
A  1.693723 -1.159119
C  0.072960  0.329646

In [76]:
df[(df["W"]>0) and (df["Y"]<0)] #we get an error

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [77]:
df[(df["W"]>0) & (df["Y"]<0)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [78]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [79]:
df.reset_index() #remember to use inplace = True to really change the df

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752

In [80]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [81]:
newIndex = "PE BA CE SE".split()
newIndex

['PE', 'BA', 'CE', 'SE']

In [82]:
df["state"] = newIndex
df

          W         X         Y         Z state
A  0.302665  1.693723 -1.706086 -1.159119    PE
B -0.134841  0.390528  0.166905  0.184502    BA
C  0.807706  0.072960  0.638787  0.329646    CE
D -0.497104 -0.754070 -0.943406  0.484752    SE

In [85]:
df.set_index("state") #inplace = True once again if you want

              W         X         Y         Z
state
PE     0.302665  1.693723 -1.706086 -1.159119
BA    -0.134841  0.390528  0.166905  0.184502
CE     0.807706  0.072960  0.638787  0.329646
SE    -0.497104 -0.754070 -0.943406  0.484752